In [7]:
import pandas as pd
df=pd.read_csv("sample.csv")

In [8]:
df

      Name  Age  Salary
0      jyo   16  10,000
1    jyosh   25  20,000
2  jyotsna   20  35,000
3    priya   21  25,000
4    satya   18  20,000
5  bhavani   17  10,000
6     usha   12  15,000

In [12]:
df=["Age"]

In [13]:
type(df)

list

In [17]:
df

['Age']

In [1]:
import pandas as pd
df=pd.read_csv("sample.csv")

In [3]:
print(df)

      Name  Age  Salary
0      jyo   16  10,000
1    jyosh   25  20,000
2  jyotsna   20  35,000
3    priya   21  25,000
4    satya   18  20,000
5  bhavani   17  10,000
6     usha   12  15,000

In [5]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 7 entries, 0 to 6
Data columns (total 3 columns):
 #   Column  Non-Null Count  Dtype
---  ------  --------------  -----
 0   Name    7 non-null      object
 1   Age     7 non-null      int64
 2   Salary  7 non-null      object
dtypes: int64(1), object(2)
memory usage: 296.0+ bytes

In [6]:
df.describe()

             Age
count   7.000000
mean   18.428571
std     4.117327
min    12.000000
25%    16.500000
50%    18.000000
75%    20.500000
max    25.000000

In [7]:
df.count()

Name      7
Age       7
Salary    7
dtype: int64

In [8]:
df.max()

Name        usha
Age           25
Salary    35,000
dtype: object

In [9]:
df.min()

Name      bhavani
Age            12
Salary     10,000
dtype: object

In [10]:
df.isnull()

    Name    Age  Salary
0  False  False   False
1  False  False   False
2  False  False   False
3  False  False   False
4  False  False   False
5  False  False   False
6  False  False   False

In [11]:
df.isnull().sum()

Name      0
Age       0
Salary    0
dtype: int64

In [12]:
df.head()

      Name  Age  Salary
0      jyo   16  10,000
1    jyosh   25  20,000
2  jyotsna   20  35,000
3    priya   21  25,000
4    satya   18  20,000

In [13]:
df.tail()

      Name  Age  Salary
2  jyotsna   20  35,000
3    priya   21  25,000
4    satya   18  20,000
5  bhavani   17  10,000
6     usha   12  15,000

In [14]:
df.loc[df["Age"]<20]

      Name  Age  Salary
0      jyo   16  10,000
4    satya   18  20,000
5  bhavani   17  10,000
6     usha   12  15,000